---
kind: method
id: M:Autodesk.Revit.UI.TabbedDialogExtension.GetContextualHelp
source: html/8493b1c7-e1ab-3e74-0ca4-e41f9c0a6a73.htm
---
# Autodesk.Revit.UI.TabbedDialogExtension.GetContextualHelp Method

Gets the contextual help.

## Syntax (C#)
```csharp
public ContextualHelp GetContextualHelp()
```

## Returns
The contextual help assigned to the help button of the Revit options dialog, or Nothing nullptr a null reference ( Nothing in Visual Basic) if there is no binding assigned.